[
  {
    "title": "Upcoming Smartphones Are Coming",
    "content": "Smartphone makers are gearing up for several new releases in June. For example, Vivo confirmed its T4 Ultra will launch on June 11 in India. The T4 Ultra boasts a 6.78″ OLED display (1.5K, 120Hz), a triple rear camera system (50MP main, 8MP ultrawide, 50MP periscope), and a high-end MediaTek Dimensity 9300 Plus chipset. Likewise, Xiaomi's sub-brand Poco is expected to introduce the Poco F7 later this month. Leaks suggest the F7 will have a 6.83″ 1.5K OLED screen (120Hz), a Snapdragon 8s Gen 4 CPU, and massive batteries (up to 7,500mAh) with 90W fast charging. These and other mid- and high-end models (like the recently released OnePlus 13s) reflect how manufacturers are expanding their lineups to cover every market segment.",
    "author": "Juliusz Błoński",
    "date": "05.06.2025r."
  },
  {
    "title": "Windows 11 to Streamline App Patching",
    "content": "At Microsoft's Build 2025 conference, the company announced a major overhaul of the Windows update system. In the near future, Windows Update will handle not just OS patches but also all application and driver updates. Under the new “Windows Update orchestration platform,” developers can plug their apps into the update infrastructure, so that programs update through Windows Update instead of separate updaters. For example, browsers or other software could stop using their built-in updater and let Windows Update download patches (from the vendor’s servers) in one unified place. This is intended to end the long-standing headache of fragmented updates on Windows. The platform is now in private preview, and when widely released it should let users and administrators update all installed apps from a single interface.",
    "author": "Juliusz Błoński",
    "date": "07.06.2025r."
  },
  {
    "title": "Cartier Confirms Data Breach",
    "content": "Luxury jeweler Cartier disclosed on June 3 that it suffered a cyberattack affecting customer data. An unauthorized actor temporarily gained access to Cartier's website systems. According to Cartier, the hackers obtained only limited client information – such as customer names, email addresses and country – and did not acquire any passwords, credit card numbers or other banking details. Cartier says it has contained the incident, upgraded its security, and informed the authorities. The breach follows similar incidents at retailers (Marks & Spencer, Victoria's Secret, etc.) this spring. Security experts note that attackers often use “credential stuffing” (replaying leaked usernames/passwords from other breaches) to exploit weak or reused logins, underscoring that no brand is immune to modern hacking attempts",
    "author": "Juliusz Błoński",
    "date": "31.05.2025r."
  },
  {
    "title": "Record-Setting Funding Rounds",
    "content": "Luxury jeweler Cartier disclosed on June 3 that it suffered a cyberattack affecting customer data. An unauthorized actor temporarily gained access to Cartier's website systems. According to Cartier, the hackers obtained only limited client information – such as customer names, email addresses and country – and did not acquire any passwords, credit card numbers or other banking details. Cartier says it has contained the incident, upgraded its security, and informed the authorities. The breach follows similar incidents at retailers (Marks & Spencer, Victoria's Secret, etc.) this spring. Security experts note that attackers often use “credential stuffing” (replaying leaked usernames/passwords from other breaches) to exploit weak or reused logins, underscoring that no brand is immune to modern hacking attempts",
    "author": "Juliusz Błoński",
    "date": "07.06.2025r."
  }
]
